export const MATRIX_RUB = {
  "a.1": {
    shares: [90, 80, 70, 50, 30],
    portfolios: [
      ["ИСЖ 1", "ИСЖ 1", "МП обл", "МП обл", "МП обл"],
      ["ИСЖ 1", "ИСЖ 1", "МП обл", "МП обл", "МП обл"],
    ],
  },
  "a.2": {
    shares: [50, 50, 50, 50, 50],
    portfolios: [
      ["АК с ЗК", "АК с ЗК", "АК гарант", "АК гарант", "АК гарант"],
      ["АК с ЗК", "АК с ЗК", "АК гарант", "АК гарант", "АК гарант"],
    ],
  },
  "a.3": {
    shares: [100, 100, 100, 100, 100],
    portfolios: [
      ["МП обл", "МП обл", "АК усл ЗК", "Нота гарант руб", "Нота гарант руб"],
      ["МП обл", "МП обл", "АК усл ЗК", "Нота гарант руб", "Нота гарант руб"],
    ],
  },
  "b.1": {
    shares: [40, 50, 40, 30, 25],
    portfolios: [
      ["МП обл", "МП обл", "МП обл", "МП обл", "МП обл"],
      ["МП обл", "МП обл", "МП обл", "МП обл", "МП обл"],
    ],
  },
  "b.2": {
    shares: [100, 100, 50, 50, 50],
    portfolios: [
      ["ПИФы обл", "ПИФы обл", "ПИФы обл", "АК 1 гарант", "АК 1 гарант"],
      ["ПИФы обл", "ПИФы обл", "ПИФы обл", "АК 1 гарант", "АК 1 гарант"],
    ],
  },
  "b.3": {
    shares: [100, 100, 100, 100, 100],
    portfolios: [
      ["", "", "АК 1 усл ЗК", "АК 1 усл ЗК", "АК 1 усл ЗК"],
      ["", "", "АК 1 усл ЗК", "АК 1 усл ЗК", "АК 1 усл ЗК"],
    ],
  },
  "c.1": {
    shares: [90, 70, 70, 50, 50],
    portfolios: [
      ["АК с ЗК", "АК с ЗК", "ДУ сбаланс руб", "ПИФ", "ПИФ"],
      ["АК с ЗК", "АК с ЗК", "ДУ сбаланс руб", "ПИФ", "ПИФ"],
    ],
  },
  "c.2": {
    shares: [50, 50, 50, 50, 80],
    portfolios: [
      ["ПИФы обл", "ПИФы обл", "ПИФ", "Нота руб", "Нота руб"],
      ["ПИФы обл", "ПИФы обл", "ПИФ", "Нота руб", "Нота руб"],
    ],
  },
  "c.3": {
    shares: [100, 100, 100, 100, 100],
    portfolios: [
      ["ПИФы обл", "ПИФы обл", "АК 2", "АК 2", "АК 2"],
      ["ПИФы обл", "ПИФы обл", "АК 2", "АК 2", "АК 2"],
    ],
  },
  "d.1": {
    shares: [80, 70, 70, 50, 25],
    portfolios: [
      ["ИСЖ руб", "ИСЖ руб", "ДУ сбаланс руб", "ПИФ", "ПИФ"],
      ["ИСЖ руб", "ИСЖ руб", "ДУ сбаланс руб", "ПИФ", "ПИФ"],
    ],
  },
  "d.2": {
    shares: [80, 50, 50, 50, 50],
    portfolios: [
      ["АК с ЗК", "АК с ЗК", "ПИФ", "Нота руб", "Нота руб"],
      ["АК с ЗК", "АК с ЗК", "ПИФ", "Нота руб", "Нота руб"],
    ],
  },
  "d.3": {
    shares: [100, 100, 100, 100, 100],
    portfolios: [
      ["ПИФы обл", "ПИФы обл", "АК 3", "АК 3", "АК 3"],
      ["ПИФы обл", "ПИФы обл", "АК 3", "АК 3", "АК 3"],
    ],
  },
  "e.1": {
    shares: [80, 70, 70, 60, 40],
    portfolios: [
      [
        "ИСЖ руб",
        "ИСЖ руб",
        "ДУ сбаланс руб",
        "ДУ сбаланс руб",
        "ДУ сбаланс руб",
      ],
      [
        "ИСЖ руб",
        "ИСЖ руб",
        "ДУ сбаланс руб",
        "ДУ сбаланс руб",
        "ДУ сбаланс руб",
      ],
    ],
  },
  "e.2": {
    shares: [100, 50, 70, 50, 50],
    portfolios: [
      ["АК с ЗК", "АК с ЗК", "ПИФы обл", "ПИФы обл", "ПИФы обл"],
      ["АК с ЗК", "АК с ЗК", "ПИФы обл", "ПИФы обл", "ПИФы обл"],
    ],
  },
  "e.3": {
    shares: [100, 100, 100, 100, 100],
    portfolios: [
      ["", "ПИФы обл", "АК с ЗК", "АК 2", "АК 2"],
      ["", "ПИФы обл", "АК с ЗК", "АК 2", "АК 2"],
    ],
  },
  "f.1": {
    shares: [90, 50, 80, 50, 50],
    portfolios: [
      [
        "ИСЖ долл Р",
        "ИСЖ долл Р",
        "ДУ сбаланс долл Р",
        "ДУ лидеры Р",
        "ДУ лидеры Р",
      ],
      ["ИСЖ долл Р", "ИСЖ долл Р", "ПИФ еврообл", "ПИФ глоб", "ПИФ глоб"],
    ],
  },
  "f.2": {
    shares: [100, 100, 50, 50, 50],
    portfolios: [
      ["ПИФ еврообл", "ДУ еврообл Р", "ПИФ глоб", "МП глоб", "Нота вал Р"],
      ["ПИФ еврообл", "ПИФ еврообл", "ПИФ глоб", "МП глоб", "Нота вал Р"],
    ],
  },
  "f.3": {
    shares: [100, 100, 100, 100, 100],
    portfolios: [
      ["", "", "МП умерен", "Нота вал Р", "МП агр"],
      ["", "", "МП умерен", "Нота вал Р", "МП агр"],
    ],
  },
  "g.1": {
    shares: [90, 80, 70, 50, 50],
    portfolios: [
      ["ИСЖ 8", "ИСЖ 8", "ДУ сбаланс руб", "ДУ сбаланс руб", "ЛБ"],
      ["ИСЖ 8", "ИСЖ 8", "ДУ сбаланс руб", "ДУ сбаланс руб", "ЛБ"],
    ],
  },
  "g.2": {
    shares: [50, 75, 50, 50, 50],
    portfolios: [
      ["АК с ЗК", "ПИФы обл", "ПИФ", "ЛБ", "ПИФ"],
      ["АК с ЗК", "ПИФы обл", "ПИФ", "ЛБ", "ПИФ"],
    ],
  },
  "g.3": {
    shares: [100, 100, 100, 100, 100],
    portfolios: [
      ["ПИФы обл", "МП обл", "АК 2", "Нота руб", "Нота руб"],
      ["ПИФы обл", "МП обл", "АК 2", "Нота руб", "Нота руб"],
    ],
  },
};
